# YOLO: обучение детекции пользовательских объектов. 
# В качестве решения необходимо предоставить word-файл и ссылку на блокнот. 
# Содержимое файла - описание проекта (детектируемых объектов), 
# описание получения набора данных, 
# описание процесса разметки данных с указанием используемого ПО. 
# В блокноте представьте программный код для демонстрации процесса обработки подготовленных данных, 
# обучения модели, 
# оценки качества модели, 
# примеры детекции объектов на изображениях и видео. 

def main():
    d = 1

if __name__ == "__main__":
    main()