# Ансамблевые методы: частный случай Bagging - метод случайного леса (Random Forest).
# Для выполнения задания возьмите датасет о заболевании сахарным диабетом. 
# В качестве базового метода используйте ранее изученный метод решающих деревьев. 
# Обязательно дайте описание гиперпараметров построенной модели. 
# Позволило ли существенно улучшить качество прогноза заболевания такое усовершенствование алгоритма? 
# Определите оптимальное количество базовых алгоритмов в ансамбле 
# (постройте график зависимости точности определения класса от количества деревьев). 
# Определите оптимальную глубину деревьев. 

def main():
    d = 1

if __name__ == '__main__':
    main()