"""
    Распознавание лиц на фото и видео. Изучите прилагаемый блокнот. 
    1) Возьмите несколько фотографий (групповых, в разном ракурсе, попробуйте добавить животных и т.д.). 
    Определите лица на фото, выделив их прямоугольной рамкой, 
    при помощи библиотеки Open CV, face_recognition из dlib, MTCNN (дополнительно отметьте характерные признаки лиц точками). 
    Сравните полученные результаты. 
    2) Подгрузите видео и образцы фото 3-х человек, которых надо найти на видео. 
    Используя библиотеку face_recognition, получите ответ - кто из искомых личностей присутствует на видео. 

"""
import numpy as np 
import os
import matplotlib.pyplot as plt

def main():
    print('Hello!')

if __name__ == "__main__":
    main()